Repository: inyutin-maxim/fluentassertions
Catalog: Src/FluentAssertions/FluentAssertions.*.resx
Languages: ru_ru

# XmlElementAssertions_HaveInnerText_FailMessageFormat
source: Expected {context:subject} to have value {0}{reason}, but found {1}.
ru_ru: Ожидалось, что {context:subject} будет иметь значение {0}{reason}, но было найдено {1}.

source: Expected {context:subject} to have attribute {0} with value {1}{reason}, but found no such attribute in {2}
ru_ru: Ожидалось, что {context:subject} будет иметь атрибут {0} со значением {1}{reason}, но такой атрибут в {2} не был найден

source: Expected attribute {0} in {context:subject} to have value {1}{reason}, but found {2}.
ru_ru: Ожидаемый атрибут {0} в {context:subject} должен иметь значение {1}{reason}, но было найдено {2}.

# XmlElementAssertions_HaveElementWithNamespace_FailMessageFormat
source: Expected {context:subject} to have child element {0}{reason}, but no such child element was found.
ru_ru: Ожидалось, что {context:subject} будет иметь дочерний элемент {0}{reason}, но такой дочерний элемент не был найден.

# ObjectAssertions_BeDataContractSerializable_FailMessageFormat
source: Expected {0} to be serializable{reason}, but serialization failed with:
ru_ru: Ожидалось, что {0} будет сериализован{reason}, но сериализация завершилась с ошибкой:

# ObjectAssertions_BeXmlSerializable_FailMessageFormat
source: Expected {0} to be serializable{reason}, but serialization failed with:
ru_ru: Ожидалось, что {0} будет сериализован{reason}, но сериализация завершилась с ошибкой:

# NullableNumericAssertionsOfDouble_NotBeNaN_FailMessageFormat
source: Did not expect {context:value} to be NaN{reason}.
ru_ru: Ожидалось, что {context:value} не будет NaN{reason}.

# NullableNumericAssertionsOfFloat_NotBeNaN_FailMessageFormat
source: Did not expect {context:value} to be NaN{reason}.
ru_ru: Ожидалось, что {context:value} не будет NaN{reason}.

# NumericAssertionsOfDouble_NotBeNaN_FailMessageFormat
source: Did not expect {context:value} to be NaN{reason}.
ru_ru: Ожидалось, что {context:value} не будет NaN{reason}.

# NumericAssertionsOfFloat_NotBeNaN_FailMessageFormat
source: Did not expect {context:value} to be NaN{reason}.
ru_ru: Ожидалось, что {context:value} не будет NaN{reason}.

# NullableNumericAssertionsOfDouble_BeNaN_FailMessageFormat
source: Expected {context:value} to be NaN{reason}, but found {0}.
ru_ru: Ожидалось, что {context:value} будет NaN{reason}, но было найдено {0}.

# NullableNumericAssertionsOfFloat_BeNaN_FailMessageFormat
source: Expected {context:value} to be NaN{reason}, but found {0}.
ru_ru: Ожидалось, что {context:value} будет NaN{reason}, но было найдено {0}.

# NumericAssertionsOfDouble_BeNaN_FailMessageFormat
source: Expected {context:value} to be NaN{reason}, but found {0}.
ru_ru: Ожидалось, что {context:value} будет NaN{reason}, но было найдено {0}.

# NumericAssertionsOfFloat_BeNaN_FailMessageFormat
source: Expected {context:value} to be NaN{reason}, but found {0}.
ru_ru: Ожидалось, что {context:value} будет NaN{reason}, но было найдено {0}.

# NumericAssertions_FailIfDifferenceWithinPrecision_FailMessageFormat
source: Expected {context:value} to not approximate {1} +/- {2}{reason}, but {0} only differed by {3}.
ru_ru: Ожидалось, что {context:value} не приближен к {1} +/- {2}{reason}, но {0} отличается только от {3}.

# NullableNumericAssertionsOfDecimal_NotBeApproximately_FailMessageFormat
source: Expected {context:value} to not approximate {0} +/- {1}{reason}, but it was {2}.
ru_ru: Ожидалось, что {context:value} не приближен к {0} +/- {1}{reason}, но имеет значение {2}.

# NullableNumericAssertionsOfDouble_NotBeApproximately_FailMessageFormat
source: Expected {context:value} to not approximate {0} +/- {1}{reason}, but it was {2}.
ru_ru: Ожидалось, что {context:value} не приближен к {0} +/- {1}{reason}, но имеет значение {2}.

# NullableNumericAssertionsOfFloat_NotBeApproximately_FailMessageFormat
source: Expected {context:value} to not approximate {0} +/- {1}{reason}, but it was {2}.
ru_ru: Ожидалось, что {context:value} не приближен к {0} +/- {1}{reason}, но имеет значение {2}.

# NumericAssertionsOfT_FailIfDifferenceOutsidePrecision_FailMessageFormat
source: Expected {context:value} to approximate {1} +/- {2}{reason}, but {0} differed by {3}.
ru_ru: Ожидалось, что {context:value} будет приближен к {1} +/- {2}{reason}, но {0} отличается на {3}.

# NullableNumericAssertionsOfDecimal_BeApproximately_FailMessageFormat
source: Expected {context:value} to approximate {0} +/- {1}{reason}, but it was {2}.
ru_ru: Ожидалось, что {context:value} будет приближен к {0} +/- {1}{reason}, но имеет значение {2}.

# NullableNumericAssertionsOfDouble_BeApproximately_FailMessageFormat
source: Expected {context:value} to approximate {0} +/- {1}{reason}, but it was {2}.
ru_ru: Ожидалось, что {context:value} будет приближен к {0} +/- {1}{reason}, но имеет значение {2}.

# NullableNumericAssertionsOfFloat_BeApproximately_FailMessageFormat
source: Expected {context:value} to approximate {0} +/- {1}{reason}, but it was {2}.
ru_ru: Ожидалось, что {context:value} будет приближен к {0} +/- {1}{reason}, но имеет значение {2}.

source: Expected {context:value} to approximate {0} +/- {1}{reason}, but it was <null>.
ru_ru: Ожидалось, что {context:value} будет приближен к {0} +/- {1}{reason}, но имеет значение <null>.

source: Expected {context:value} to approximate {0} +/- {1}{reason}, but it was <null>.
ru_ru: Ожидалось, что {context:value} будет приближен к {0} +/- {1}{reason}, но имеет значение <null>.

source: Expected {context:value} to approximate {0} +/- {1}{reason}, but it was <null>.
ru_ru: Ожидалось, что {context:value} будет приближен к {0} +/- {1}{reason}, но имеет значение <null>.

# NumericAssertions_FailIfValueInsideBounds_FailMessageFormat
source: Did not expect {context:value} to be within {0} from {1}{reason}, but found {2}.
ru_ru: Ожидалось, что {context:value} не находится в пределах {0} до {1}{reason}, но было найдено {2}.

# NumericAssertions_FailIfValueOutsideBounds_FailMessageFormat
source: Expected {context:value} to be within {0} from {1}{reason}, but found {2}.
ru_ru: Ожидалось, что {context:value} находится в пределах {0} до {1}{reason}, но было найдено {2}.

# ExceptionAssertions_WithParameterName_FailMessageFormat
source: Expected exception with parameter name {0}{reason}, but found {1}.
ru_ru: Ожидалось, что исключение с именем параметра {0}{reason}, но было найдено {1}.

# OccurrenceConstraint_ExceptionMessage
source: Expected count cannot be negative.
ru_ru: Ожидалось, что значение не может быть отрицательным.

# EventRaisingExtensions_WithSender_EveryEvent_FailMessageFormat
source: Expected event from sender {0}, but event {1} does not have any parameters
ru_ru: Ожидалось, что событие от отправителя будет {0}, но событие {1} не имеет параметров

# EventRaisingExtensions_WithSender_Senders_FailMessageFormat
source: Expected sender {0}, but found {1}.
ru_ru: Ожидалось, что отправитель будет {0}, но был найден {1}.

# EventRaisingExtensions_WithArgs_FailMessageFormat
source: Expected at least one event with some argument of type <{0}> that matches {1}, but found none.
ru_ru: Ожидалось, что по крайней мере одно событие с аргументом типа <{0}>, который соответствует {1}, но не было найдено.

# EventRaisingExtensions_WithArgs_EventArgumentException_ExceptionMessageFormat
source: Expected the event to have at least {0} parameters of type {1}, but only found {2}.
ru_ru: Ожидалось, что событие будет иметь как минимум {0} параметров типа {1}, но было найдено только {2}.

# EventRaisingExtensions_WithArgs_FoundMatchingEvent_FailMessageFormat
source: Expected at least one event with some arguments of type <{0}> that pairwise match {1}, but found none.
ru_ru: Ожидалось, что по крайней мере одно событие с некоторыми аргументами типа <{0}>, попарно соответствующими {1}, но не было найдено ни одного.

# XElementAssertions_HaveValue_SubjectIsNull_FailMessageFormat
source: Expected the element to have value {0}{reason}, but {context:member} is <null>.
ru_ru: Ожидалось, что элемент имеет значение {0} {reason}, но {context: member} имеет значение <null>.

# XElementAssertions_HaveValue_SubjectIsNotEqualExpected_FailMessageFormat
source: Expected {context:subject} '{0}' to have value {1}{reason}, but found {2}.
ru_ru: Ожидалось, что {context:subject} '{0}' будет иметь значение {1}{reason}, но было найдено {2}.

# XElementAssertions_HaveAttribute_SubjectIsNull_FailMessageFormat
source: Expected attribute {0} in element to have value {1}{reason}, but {context:member} is <null>.
ru_ru: Ожидаемый атрибут {0} в элементе должен иметь значение {1}{reason}, но {context:member} имеет значение <null>.

# XElementAssertions_HaveAttribute_AttributeIsNull_FailMessageFormat
source: Expected {context:subject} to have attribute {0} with value {1}{reason}, but found no such attribute in {2}
ru_ru: Ожидалось, что {context:subject} имеет атрибут {0} со значением {1}{reason}, но такой атрибут в {2} не был найден.

# XElementAssertions_HaveAttribute_AttributeIsNotEqualExpected_FailMessageFormat
source: Expected attribute {0} in {context:subject} to have value {1}{reason}, but found {2}.
ru_ru: Ожидаемый атрибут {0} в {context:subject} должен иметь значение {1}{reason}, но было найдено {2}.

# XElementAssertions_HaveElement_SubjectIsNull_FailMessageFormat
source: Expected the element to have child element {0}{reason}, but {context:member} is <null>.
ru_ru: Ожидалось, что элемент имеет дочерний элемент {0}{reason}, но {context:member} имеет значение <null>.

# XElementAssertions_HaveElement_ElementIsNull_FailMessageFormat
source: Expected {context:subject} to have child element {0}{reason}, but no such child element was found.
ru_ru: Ожидалось, что {context:subject} будет иметь дочерний элемент {0}{reason}, но такой дочерний элемент не был найден.

# XElementAssertions_HaveElement_GuardExpectedValue_GuardMessageFormat
source: Cannot assert the element has an element count if the element name is <null>.
ru_ru: Невозможно утверждать, что элемент имеет количество элементов, если имя элемента равно <null>.

# XElementAssertions_HaveElementForEnumerable_SubjectIsNull_FailMessageFormat
source: Expected {context:subject} to have an element with count of {0}{reason}, but the element itself is <null>.
ru_ru: Ожидалось, что {context:subject} имеет элемент с количеством {0}{reason}, но элемент имеет значение <null>.

source: Expected {context:subject} to have an element {0} {expectedOccurrence}{reason}, but found it {1}.
ru_ru: Ожидалось, что {context:subject} имеет элемент {0} {expectedOccurrence}{reason}, но было найдено {1}.

source: Cannot assert the element has an element if the expected name is <null>.
ru_ru: Невозможно утверждать, что элемент имеет элемент, если ожидаемое имя равно <null>.

# XElementAssertions_NotBe_FailMessageFormat
source: Did not expect {context:subject} to be {0}{reason}.
ru_ru: Ожидалось, что {context:subject} не будет {0}{reason}.

# XElementAssertions_Be_FailMessageFormat
source: Expected {context:subject} to be {0}{reason}, but found {1}.
ru_ru: Ожидалось, что {context:subject} будет {0}{reason}, но было найдено {1}.

source: Cannot determine approximation of a float to NaN
ru_ru: Невозможно определить приближение числа с плавающей запятой к NaN

source: Cannot determine approximation of a double to NaN
ru_ru: Невозможно определить приближение double к NaN

source: Cannot determine approximation of a float to NaN
ru_ru: Невозможно определить приближение числа с плавающей запятой к NaN

source: Cannot determine approximation of a double to NaN
ru_ru: Невозможно определить приближение double к NaN

# AndWhichConstraint_SingleOrDefault_ExceptionMessageFormat
source: More than one object found. FluentAssertions cannot determine which object is meant. Found objects:{0}{1}
ru_ru: Найдено более одного объекта. FluentAssertions не может определить, какой объект имеется в виду. Найдены объекты:{0}{1}

# XDocumentAssertions_Be_SubjectNotEqualsExpected_FailMessageFormat
source: Expected {context:subject} to be {0}{reason}, but found {1}.
ru_ru: Ожидалось, что {context:subject} будет {0}{reason}, но было найдено {1}.

# XDocumentAssertions_NotBe_SubjectEqualsUneExpected_FailMessageFormat
source: Did not expect {context:subject} to be {0}{reason}.
ru_ru: Ожидалось, что {context:subject} не будет {0}{reason}.

# XDocumentAssertions_HaveRoot_GuardThrowIfArgumentIsNull_GuardMessageFormat
source: Cannot assert the document has a root element if the expected name is <null>.
ru_ru: Невозможно утверждать, что документ имеет корневой элемент, если ожидаемое имя <null>.

# XDocumentAssertions_HaveRoot_InvalidOperationException_ExceptionMessageFormat
source: Cannot assert the document has a root element if the document itself is <null>.
ru_ru: Невозможно утверждать, что документ имеет корневой элемент, если сам документ <null>.

source: Cannot assert the document has a root element if the expected name is <null>.
ru_ru: Невозможно утверждать, что документ имеет корневой элемент, если ожидаемое имя <null>.

source: Expected {context:subject} to have root element {0}{reason}, but found {1}.
ru_ru: Ожидалось, что {context:subject} будет иметь корневой элемент {0}{reason}, но было найдено {1}.

source: Cannot assert the document has an element if the expected name is <null>.
ru_ru: Невозможно утверждать, что документ содержит элемент, если ожидаемое имя <null>.

source: Cannot assert the document has an element if the expected name is <null>.
ru_ru: Невозможно утверждать, что документ содержит элемент, если ожидаемое имя <null>.

source: Cannot assert the document has an element if the expected name is <null>.
ru_ru: Невозможно утверждать, что документ содержит элемент, если ожидаемое имя <null>.

source: Cannot assert the document has an element if the document itself is <null>.
ru_ru: Невозможно утверждать, что документ имеет элемент, если сам документ <null>.

# XDocumentAssertions_HaveElement_SubjectRootIsNull_FailMessageFormat
source: Expected {context:subject} to have root element with child {0}{reason}, but it has no root element.
ru_ru: Ожидалось, что {context:subject} имеет корневой элемент с дочерним элементом {0}{reason}, но у него нет корневого элемента.

# XDocumentAssertions_HaveElement_ElementIsNull_FailMessageFormat
source: Expected {context:subject} to have root element with child {0}{reason}, but no such child element was found.
ru_ru: Ожидалось, что {context:subject} имеет корневой элемент с дочерним элементом {0}{reason}, но такой дочерний элемент не был найден.

source: Cannot assert the document has an element count if the element name is <null>.
ru_ru: Невозможно утверждать, что документ имеет количество элементов, если имя элемента <null>.

source: Cannot assert the count if the document itself is <null>.
ru_ru: Невозможно утвердить счетчик, если сам документ <null>.

source: Expected {context:subject} to have root element containing a child {0}{reason}, but it has no root element.
ru_ru: Ожидалось, что {context:subject} будет иметь корневой элемент, содержащий дочерний элемент {0}{reason}, но у него нет корневого элемента.

source: Expected {context:subject} to have a root element containing a child {0} {expectedOccurrence}{reason}, but found it {1}.
ru_ru: Ожидалось, что {context:subject} будет иметь корневой элемент, содержащий дочерний элемент {0} {expectedOccurrence}{reason}, но было найдено {1}.

# XAttributeAssertions_Be_SubjectNotEqualsExpected_FailMessageFormat
source: Expected {context} to be {0}{reason}, but found {1}.
ru_ru: Ожидалось, что {context} будет иметь значение {0}{reason}, но было найдено {1}.

# XAttributeAssertions_NotBe_SubjectEqualsUneExpected_FailMessageFormat
source: Did not expect {context} to be {0}{reason}.
ru_ru: Ожидалось, что {context} не будет иметь значение {0}{reason}.

# XAttributeAssertions_HaveValue_SubjectIsNull_FailMessageFormat
source: Expected the attribute to have value {0}{reason}, but {context:member} is <null>.
ru_ru: Ожидалось, что атрибут будет иметь значение {0}{reason}, но {context:member} имеет значение <null>.

# XAttributeAssertions_HaveValue_SubjectIsNotEqualExpected_FailMessageFormat
source: Expected {context} "{0}" to have value {1}{reason}, but found {2}.
ru_ru: Ожидалось, что {context} "{0}" будет иметь значение {1}{reason}, но было найдено {2}.
